MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAL176/mcu.h
extern volatile __SBT5REG3bits_t SBT5REG3bits __asm__ ("SBT5REG3") __attribute__((section("sfrs"), address(0xBF8F94A0)));
#define SBT5RD3 SBT5RD3
extern volatile uint32_t   SBT5RD3 __attribute__((section("sfrs"), address(0xBF8F94B0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD3bits_t;
extern volatile __SBT5RD3bits_t SBT5RD3bits __asm__ ("SBT5RD3") __attribute__((section("sfrs"), address(0xBF8F94B0)));
#define SBT5WR3 SBT5WR3
extern volatile uint32_t   SBT5WR3 __attribute__((section("sfrs"), address(0xBF8F94B8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR3bits_t;
extern volatile __SBT5WR3bits_t SBT5WR3bits __asm__ ("SBT5WR3") __attribute__((section("sfrs"), address(0xBF8F94B8)));
#define SBT5REG4 SBT5REG4
extern volatile uint32_t   SBT5REG4 __attribute__((section("sfrs"), address(0xBF8F94C0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG4bits_t;
extern volatile __SBT5REG4bits_t SBT5REG4bits __asm__ ("SBT5REG4") __attribute__((section("sfrs"), address(0xBF8F94C0)));
#define SBT5RD4 SBT5RD4
extern volatile uint32_t   SBT5RD4 __attribute__((section("sfrs"), address(0xBF8F94D0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD4bits_t;
extern volatile __SBT5RD4bits_t SBT5RD4bits __asm__ ("SBT5RD4") __attribute__((section("sfrs"), address(0xBF8F94D0)));
#define SBT5WR4 SBT5WR4
extern volatile uint32_t   SBT5WR4 __attribute__((section("sfrs"), address(0xBF8F94D8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR4bits_t;
extern volatile __SBT5WR4bits_t SBT5WR4bits __asm__ ("SBT5WR4") __attribute__((section("sfrs"), address(0xBF8F94D8)));
#define SBT6ELOG1 SBT6ELOG1
extern volatile uint32_t   SBT6ELOG1 __attribute__((section("sfrs"), address(0xBF8F9820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT6ELOG1bits_t;
extern volatile __SBT6ELOG1bits_t SBT6ELOG1bits __asm__ ("SBT6ELOG1") __attribute__((section("sfrs"), address(0xBF8F9820)));
#define SBT6ELOG2 SBT6ELOG2
extern volatile uint32_t   SBT6ELOG2 __attribute__((section("sfrs"), address(0xBF8F9824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT6ELOG2bits_t;
extern volatile __SBT6ELOG2bits_t SBT6ELOG2bits __asm__ ("SBT6ELOG2") __attribute__((section("sfrs"), address(0xBF8F9824)));
#define SBT6ECON SBT6ECON
extern volatile uint32_t   SBT6ECON __attribute__((section("sfrs"), address(0xBF8F9828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT6ECONbits_t;
extern volatile __SBT6ECONbits_t SBT6ECONbits __asm__ ("SBT6ECON") __attribute__((section("sfrs"), address(0xBF8F9828)));
#define SBT6ECLRS SBT6ECLRS
extern volatile uint32_t   SBT6ECLRS __attribute__((section("sfrs"), address(0xBF8F9830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT6ECLRSbits_t;
extern volatile __SBT6ECLRSbits_t SBT6ECLRSbits __asm__ ("SBT6ECLRS") __attribute__((section("sfrs"), address(0xBF8F9830)));
#define SBT6ECLRM SBT6ECLRM
extern volatile uint32_t   SBT6ECLRM __attribute__((section("sfrs"), address(0xBF8F9838)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT6ECLRMbits_t;
extern volatile __SBT6ECLRMbits_t SBT6ECLRMbits __asm__ ("SBT6ECLRM") __attribute__((section("sfrs"), address(0xBF8F9838)));
#define SBT6REG0 SBT6REG0
extern volatile uint32_t   SBT6REG0 __attribute__((section("sfrs"), address(0xBF8F9840)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT6REG0bits_t;
extern volatile __SBT6REG0bits_t SBT6REG0bits __asm__ ("SBT6REG0") __attribute__((section("sfrs"), address(0xBF8F9840)));
#define SBT6RD0 SBT6RD0
extern volatile uint32_t   SBT6RD0 __attribute__((section("sfrs"), address(0xBF8F9850)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6RD0bits_t;
extern volatile __SBT6RD0bits_t SBT6RD0bits __asm__ ("SBT6RD0") __attribute__((section("sfrs"), address(0xBF8F9850)));
#define SBT6WR0 SBT6WR0
extern volatile uint32_t   SBT6WR0 __attribute__((section("sfrs"), address(0xBF8F9858)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6WR0bits_t;
extern volatile __SBT6WR0bits_t SBT6WR0bits __asm__ ("SBT6WR0") __attribute__((section("sfrs"), address(0xBF8F9858)));
#define SBT6REG1 SBT6REG1
extern volatile uint32_t   SBT6REG1 __attribute__((section("sfrs"), address(0xBF8F9860)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT6REG1bits_t;
extern volatile __SBT6REG1bits_t SBT6REG1bits __asm__ ("SBT6REG1") __attribute__((section("sfrs"), address(0xBF8F9860)));
#define SBT6RD1 SBT6RD1
extern volatile uint32_t   SBT6RD1 __attribute__((section("sfrs"), address(0xBF8F9870)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6RD1bits_t;
extern volatile __SBT6RD1bits_t SBT6RD1bits __asm__ ("SBT6RD1") __attribute__((section("sfrs"), address(0xBF8F9870)));
#define SBT6WR1 SBT6WR1
extern volatile uint32_t   SBT6WR1 __attribute__((section("sfrs"), address(0xBF8F9878)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT6WR1bits_t;
extern volatile __SBT6WR1bits_t SBT6WR1bits __asm__ ("SBT6WR1") __attribute__((section("sfrs"), address(0xBF8F9878)));
#define SBFLAG1 SBFLAG1
extern volatile uint32_t   SBFLAG1 __attribute__((section("sfrs"), address(0xBF900510)));
typedef struct {
  uint32_t T7PGV:1;
  uint32_t T8PGV:1;
  uint32_t T9PGV:1;
  uint32_t T10PGV:1;
  uint32_t T11PGV:1;
  uint32_t T12PGV:1;
  uint32_t T0PGV1:1;
} __SBFLAG1bits_t;
extern volatile __SBFLAG1bits_t SBFLAG1bits __asm__ ("SBFLAG1") __attribute__((section("sfrs"), address(0xBF900510)));
#define SBT7ELOG1 SBT7ELOG1
extern volatile uint32_t   SBT7ELOG1 __attribute__((section("sfrs"), address(0xBF908420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT7ELOG1bits_t;
extern volatile __SBT7ELOG1bits_t SBT7ELOG1bits __asm__ ("SBT7ELOG1") __attribute__((section("sfrs"), address(0xBF908420)));
#define SBT7ELOG2 SBT7ELOG2
extern volatile uint32_t   SBT7ELOG2 __attribute__((section("sfrs"), address(0xBF908424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT7ELOG2bits_t;
extern volatile __SBT7ELOG2bits_t SBT7ELOG2bits __asm__ ("SBT7ELOG2") __attribute__((section("sfrs"), address(0xBF908424)));
#define SBT7ECON SBT7ECON
extern volatile uint32_t   SBT7ECON __attribute__((section("sfrs"), address(0xBF908428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT7ECONbits_t;
extern volatile __SBT7ECONbits_t SBT7ECONbits __asm__ ("SBT7ECON") __attribute__((section("sfrs"), address(0xBF908428)));
#define SBT7ECLRS SBT7ECLRS
extern volatile uint32_t   SBT7ECLRS __attribute__((section("sfrs"), address(0xBF908430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT7ECLRSbits_t;
